; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 801405 1 3 4 8 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	image0 - mode
	image1 - mode
	infrared2 - mode
	infrared3 - mode
	GroundStation1 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	Star6 - direction
	Star0 - direction
	Star3 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 infrared3)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star6)
	(supports instrument1 image1)
	(supports instrument1 infrared2)
	(supports instrument1 infrared3)
	(supports instrument1 image0)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star12)
)
(:goal (and
	(pointing satellite0 Planet8)
	(have_image Planet8 infrared2)
	(have_image Phenomenon9 image0)
	(have_image Planet10 image0)
	(have_image Star11 infrared2)
	(have_image Star12 infrared3)
	(have_image Phenomenon13 image1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 7
2. (turn_to satellite0 star0 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star0)
   goals met: 0 of 7
3. (calibrate satellite0 instrument1 star0)
   added: (calibrated instrument1)
   goals met: 0 of 7
4. (turn_to satellite0 star11 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star11)
   goals met: 0 of 7
5. (take_image satellite0 star11 instrument1 infrared2)
   added: (have_image star11 infrared2)
   goals met: 1 of 7
6. (turn_to satellite0 planet8 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet8)
   goals met: 2 of 7
7. (take_image satellite0 planet8 instrument1 infrared2)
   added: (have_image planet8 infrared2)
   goals met: 3 of 7
8. (turn_to satellite0 planet10 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet10)
   goals met: 2 of 7
9. (take_image satellite0 planet10 instrument1 image0)
   added: (have_image planet10 image0)
   goals met: 3 of 7
10. (turn_to satellite0 planet8 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet8)
   goals met: 4 of 7
11. (turn_to satellite0 phenomenon9 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon9)
   goals met: 3 of 7
12. (take_image satellite0 phenomenon9 instrument1 image0)
   added: (have_image phenomenon9 image0)
   goals met: 4 of 7
13. (turn_to satellite0 planet8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet8)
   goals met: 5 of 7
14. (turn_to satellite0 phenomenon13 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 phenomenon13)
   goals met: 4 of 7
15. (take_image satellite0 phenomenon13 instrument1 image1)
   added: (have_image phenomenon13 image1)
   goals met: 5 of 7
16. (turn_to satellite0 planet8 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet8)
   goals met: 6 of 7
17. (turn_to satellite0 star12 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star12)
   goals met: 5 of 7
18. (take_image satellite0 star12 instrument1 infrared3)
   added: (have_image star12 infrared3)
   goals met: 6 of 7
19. (turn_to satellite0 planet8 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet8)
   goals met: 7 of 7
